###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID ra01)
#  Generated on:      Thu Jan 22 17:30:33 2026
#  Design:            counter
###############################################################
current_design counter
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 6.000000 -waveform {0.000000 3.000000}
set_max_fanout 5  [get_designs {counter}]
set_max_transition 0.6  [get_designs {counter}]
set_input_delay -add_delay 0.6 -clock [get_clocks {clk}] [get_ports {reset}]
set_output_delay -add_delay 0.6 -clock [get_clocks {clk}] [get_ports {count[7]}]
set_output_delay -add_delay 0.6 -clock [get_clocks {clk}] [get_ports {count[5]}]
set_output_delay -add_delay 0.6 -clock [get_clocks {clk}] [get_ports {count[3]}]
set_output_delay -add_delay 0.6 -clock [get_clocks {clk}] [get_ports {count[1]}]
set_output_delay -add_delay 0.6 -clock [get_clocks {clk}] [get_ports {count[6]}]
set_output_delay -add_delay 0.6 -clock [get_clocks {clk}] [get_ports {count[4]}]
set_output_delay -add_delay 0.6 -clock [get_clocks {clk}] [get_ports {count[2]}]
set_output_delay -add_delay 0.6 -clock [get_clocks {clk}] [get_ports {count[0]}]
