###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID ra01)
#  Generated on:      Wed Jan 21 12:37:39 2026
#  Design:            simple_alu
###############################################################
current_design simple_alu
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock  -name VIR_CLK -period 10.000000 -waveform {0.000000 5.000000}
set_max_fanout 5  [get_designs {simple_alu}]
set_max_transition 1.5  [get_designs {simple_alu}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[4]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[10]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[26]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[19]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[10]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[9]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[9]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[22]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[15]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[0]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[0]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[22]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[15]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[27]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[5]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[5]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[11]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[27]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[11]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[30]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[23]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[16]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[1]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[1]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[30]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[23]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[16]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[28]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[6]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {ALUControl[0]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[6]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[12]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[28]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[12]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[31]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[24]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[17]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[2]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[2]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[31]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[24]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[17]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[29]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[7]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {ALUControl[1]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[7]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[20]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[13]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[29]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[20]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[13]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[25]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[18]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[3]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[3]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[25]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[18]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[8]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[8]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[21]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[14]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[21]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {A[14]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[26]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[19]}]
set_input_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {B[4]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[29]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[27]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[25]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[18]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[30]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[23]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[16]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[9]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[21]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[14]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[7]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[12]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[5]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[10]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[3]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[1]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[28]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[26]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[19]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[31]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[24]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[17]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[22]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[15]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[8]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Cout}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[20]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[13]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[6]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {zero}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[11]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[4]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[2]}]
set_output_delay -add_delay 1.5 -clock [get_clocks {VIR_CLK}] [get_ports {Result[0]}]
